Revit 2027 API
BuiltInFailures.OpeningFailures.PropertyNotClosed Property
 Property lines do not form a closed loop. Area will not be computed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PropertyNotClosed { get; }
Public Shared ReadOnly Property PropertyNotClosed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PropertyNotClosed {
	FailureDefinitionId^ get ();
}
static member PropertyNotClosed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace